<?php

return [
    "confirm_password_message" => "Пожалуйста, подтвердите свой пароль, чтобы продолжить.",
    "email" => "Эл. адрес",
    "full_name" => "Полное имя",
    "i_already_have_a_membership" => "У меня уже есть членство",
    "i_forgot_my_password" => "Я забыл свой пароль",
    "log_out" => "Выйти",
    "login_message" => "Войдите, чтобы начать свой сеанс",
    "password" => "Пароль",
    "password_reset_message" => "Сброс пароля",
    "register" => "регистр",
    "register_a_new_membership" => "Зарегистрировать новое членство",
    "register_message" => "Зарегистрировать новое членство",
    "remember_me" => "Запомни меня",
    "remember_me_hint" => "Держите меня аутентифицировать бесконечно или до тех пор, пока я не вручную выхожу",
    "reset_password" => "Сброс пароля",
    "retype_password" => "Введите пароль еще раз",
    "send_password_reset_link" => "Отправить Ссылка сброса пароля",
    "sign_in" => "Войти",
    "toggle_navigation" => "Переключить навигацию",
    "verify_check_your_email" => "Перед продолжением, пожалуйста, проверьте вашу электронную почту для ссылки проверки.",
    "verify_email_sent" => "Ссылка на свежую проверку была отправлена ​​на ваш адрес электронной почты.",
    "verify_if_not_recieved" => "Если вы не получили электронное письмо",
    "verify_message" => "Ваша учетная запись нуждается в проверке",
    "verify_request_another" => "Нажмите здесь, чтобы запросить другое"
];
