<?php

return [
    "accepted" => "Атрибут: Атрибут должен быть принят.",
    "accepted_if" => "Атрибут: Атрибут должен быть принят, когда: Другое: Значение.",
    "active_url" => "Атрибут: атрибут не является действительным URL.",
    "after" => "Атрибут: атрибут должен быть датой после: дата.",
    "after_or_equal" => "Атрибут: атрибут должен быть датой после или равна: дата.",
    "alpha" => "Атрибут: атрибут должен содержать только буквы.",
    "alpha_dash" => "Атрибут: атрибут должен содержать только буквы, цифры, тире и подчеркивает.",
    "alpha_num" => "Атрибут: атрибут должен содержать только буквы и цифры.",
    "array" => "Атрибут: атрибут должен быть массивом.",
    "before" => "Атрибут: атрибут должен быть датой до: дата.",
    "before_or_equal" => "Атрибут: атрибут должен быть датой до или равна: дата.",
    "between" => [
        "array" => "Атрибут: атрибут должен иметь между: мин и: максимальные элементы.",
        "file" => "Атрибут: атрибут должен быть между: мин и: максимальные килобайты.",
        "numeric" => "Атрибут: атрибут должен быть между: мин и: макс.",
        "string" => "Атрибут: атрибут должен быть между: мин и: max символы."
    ],
    "boolean" => "Поле: атрибут поле должно быть правдой или ложным.",
    "confirmed" => "Подтверждение: атрибут подтверждение не совпадает.",
    "current_password" => "Пароль неправильный.",
    "custom" => [
        "attribute-name" => [
            "rule-name" => "Пользовательское сообщение"
        ]
    ],
    "date" => "Атрибут: атрибут не является действительной датой.",
    "date_equals" => "Атрибут: атрибут должен быть датой, равной: дата.",
    "date_format" => "Атрибут: атрибут не соответствует формату: формат.",
    "declined" => "Атрибут: должен быть отклонен.",
    "declined_if" => "Атрибут: атрибут должен быть отклонен, когда: другое: значение.",
    "different" => "Атрибут: атрибут и: другие должны быть разными.",
    "digits" => "Атрибут: атрибут должен быть: цифры цифры.",
    "digits_between" => "Атрибут: атрибут должен быть между: мин и: максимальные цифры.",
    "dimensions" => "Атрибут: имеет неверные размеры изображения.",
    "distinct" => "Поле: атрибут имеет дублирующее значение.",
    "email" => "Атрибут: атрибут должен быть действительным адресом электронной почты.",
    "ends_with" => "Атрибут: атрибут должен закончиться одним из следующих:: Значения.",
    "enum" => "Выбранный: атрибут недействителен.",
    "exists" => "Выбранный: атрибут недействителен.",
    "file" => "Атрибут: атрибут должен быть файлом.",
    "filled" => "Поле: атрибут поле должно иметь значение.",
    "gt" => [
        "array" => "Атрибут: атрибут должен иметь больше, чем: стоимость элементов.",
        "file" => "Атрибут: атрибут должен быть больше: значение килобайт.",
        "numeric" => "Атрибут: атрибут должен быть больше: значение.",
        "string" => "Атрибут: атрибут должен быть больше: значение Value."
    ],
    "gte" => [
        "array" => "Атрибут: Атрибут должен иметь: Значение элементов или более.",
        "file" => "Атрибут: атрибут должен быть больше или равен: значение килобайта.",
        "numeric" => "Атрибут: атрибут должен быть больше или равен: значение.",
        "string" => "Атрибут: атрибут должен быть больше или равен: значении символов."
    ],
    "image" => "Атрибут: атрибут должен быть образ.",
    "in" => "Выбранный: атрибут недействителен.",
    "in_array" => "Поле: атрибут не существует в: другое.",
    "integer" => "Атрибут: атрибут должен быть целым числом.",
    "ip" => "Атрибут: атрибут должен быть действительным IP-адресом.",
    "ipv4" => "Атрибут: атрибут должен быть действительным IPv4-адресом.",
    "ipv6" => "Атрибут: атрибут должен быть действительным адресом IPv6.",
    "json" => "Атрибут: атрибут должен быть действительной строкой JSON.",
    "lt" => [
        "array" => "Атрибут: атрибут должен иметь меньше: значение стоимости.",
        "file" => "Атрибут: атрибут должен быть меньше: значение килобайт.",
        "numeric" => "Атрибут: атрибут должен быть меньше: значение.",
        "string" => "Атрибут: атрибут должен быть меньше: значение Value."
    ],
    "lte" => [
        "array" => "Атрибут: атрибут не должен иметь больше, чем: стоимость элементов.",
        "file" => "Атрибут: атрибут должен быть меньше или равен: значение килобайта.",
        "numeric" => "Атрибут: атрибут должен быть меньше или равен: значение.",
        "string" => "Атрибут: атрибут должен быть меньше или равен: символы значения."
    ],
    "mac_address" => "Атрибут: атрибут должен быть действительным MAC-адресом.",
    "max" => [
        "array" => "Атрибут: не должен иметь больше: максимальные элементы.",
        "file" => "Атрибут: атрибут не должен быть больше: максимальные килобайты.",
        "numeric" => "Атрибут: атрибут не должен быть больше: max.",
        "string" => "Атрибут: атрибут не должен быть больше: max символы."
    ],
    "mimes" => "Атрибут: атрибут должен быть файл типа:: значения.",
    "mimetypes" => "Атрибут: атрибут должен быть файл типа:: значения.",
    "min" => [
        "array" => "Атрибут: должен иметь как минимум: минимальные элементы.",
        "file" => "Атрибут: атрибут должен быть хотя бы: мин килобайт.",
        "numeric" => "Атрибут: атрибут должен быть хотя бы: мин.",
        "string" => "Атрибут: атрибут должен быть как минимум: минимальные символы."
    ],
    "multiple_of" => "Атрибут: атрибут должен быть кратным: значением.",
    "not_in" => "Выбранный: атрибут недействителен.",
    "not_regex" => "Формат: атрибут недействителен.",
    "numeric" => "Атрибут: атрибут должен быть числом.",
    "password" => "Пароль неправильный.",
    "present" => "Поле: атрибут поле должно присутствовать.",
    "prohibited" => "Поле: атрибут поле запрещено.",
    "prohibited_if" => "Поле: Атрибут поле запрещено, когда: Другое: Значение.",
    "prohibited_unless" => "Поле: атрибут поле запрещено, если: Другое отсутствует: значения.",
    "prohibits" => "Поле: атрибут запрещает: другие от присутствия.",
    "regex" => "Формат: атрибут недействителен.",
    "required" => "Поле: атрибут поле обязательна.",
    "required_if" => "Поле: атрибут требуется, когда: другое: значение.",
    "required_unless" => "Поле: Атрибут требуется, если: Другое не находится в: значения.",
    "required_with" => "Поле: Атрибут поле требуется, когда: значения присутствуют.",
    "required_with_all" => "Поле: атрибут поле требуется, когда: значения присутствуют.",
    "required_without" => "Поле: атрибут поле требуется, когда: значения нет.",
    "required_without_all" => "Поле: атрибут требуется, когда ни одно из: значений нет.",
    "same" => "Атрибут: атрибут и: другое должно совпадать.",
    "size" => [
        "array" => "Атрибут: атрибут должен содержать: размер элементов.",
        "file" => "Атрибут: атрибут должен быть: размер килобайт.",
        "numeric" => "Атрибут: атрибут должен быть: размер.",
        "string" => "Атрибут: атрибут должен быть: символы размера."
    ],
    "starts_with" => "Атрибут: Атрибут должен начинаться с одного из следующих:: Значения.",
    "string" => "Атрибут: атрибут должен быть строкой.",
    "timezone" => "Атрибут: атрибут должен быть действительным часовым поясом.",
    "unique" => "Атрибут: атрибут уже принят.",
    "uploaded" => "Атрибут: не удалось загрузить.",
    "url" => "Атрибут: атрибут должен быть действительным URL.",
    "uuid" => "Атрибут: атрибут должен быть действительным UUID."
];
